Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedTemperatureLoad Methods
The AnalysisDecomposedTemperatureLoad type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis decomposed temperature load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisDecomposedTemperatureLoad Class
Tekla.Structures.Analysis Namespace